app/controllers/users_controller.rb

	def index
		@book = Book.new
		@users = User.all
---
SELECT "users".* FROM "users"

	def edit
		# @book = Book.find(params[:id])
		@user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]

	def update
		# book = book.find(params[:id])
		# book.update(book_params)
		# redirect_to book_path
		@user = User.find(params[:id])
		if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "0da612a86d3a7dd3f34a0d0be680c00c6cacb7f0655f0a0f2e77fc9bc318"], ["updated_at", "2020-07-16 05:55:49.741691"], ["id", 23]]